import React, { Component } from "react";

export default class About extends Component {
  render() {
    return (
      <div>
        <h1>About</h1>
        由于每天都抽烟，有时候会感觉我身体里都是烟，感觉我就是个烟 + 吉他 +
        计算机 + 数学 + 哲学的结合体。
        <p>
          但我的计算机知识在广阔的计算机领域中显得非常的渺小，只知道
          CRUD，或者换门语言来
          CRUD。那些编译器，计算性理伦，操作系统，算法数据结构都很是一知半解，倒也不是不感兴趣，业余也会经常研究。
        </p>
        <p>
          由于兴趣太广，所以哪怕是编程业务中经常用到 NativeApp/Web,
          路由/中间件，服务器/数据库，却都研究得不是很深。
        </p>
        <p>兴趣广到什么程度呢，我还研究数学和哲学。</p>
        <p>
          数学目前还在学高数，虽然对非欧几何，数论分析，多变量积分，抽象代数，应用数学非常非常的好奇，
        </p>
        <p>
          但这些都需要时间，或许运气不好，也或者是天性使然，关是谋生生活赚钱买书就花费我好大力气了。
        </p>
        <p>
          哲学却是因为曾经有段把时间都花在写代码，一个人生活的时间后。对人生产生了疑惑而研究的，那段时间里总是好奇人类为何而活，我为什么存在，
          人与人如何交往，为何交往之类的问题。哲学让我看世界更清晰，或许是数学和哲学学得太过认真，带来些许小麻烦，打字时一个词语总想给予其清晰的定义。
          与人聊天时，要是谁定义不准确或存在误区，思想上有谬误，言论带着偏见时，总是想给予纠正。以至跟人讨论世间琐事时总给人一副在吵架的样子。
        </p>
        <p>由于时间尚浅，年幼，所以哲学也研究得不是很深透。</p>
        <p>
          吉他学了半年，脑海里记得的完整谱子只有 River Flows in You
          这首歌，其他像 sunflower、卡农、moon river... 记得的也是零星半点。
          想学的曲子也非常的多，小深原俊很有古典风味的曲子，押尾桑那些总是给人脑海一种炸裂感的曲子，岸部真明那些温柔的曲子。唔，至少有生之年也不愁弹得完了。
          不过对比这浩瀚的音乐海洋，我这吉他学得也只能算是粒小雨滴。
        </p>
        <p>
          结果说了这么多，除了烟样样没个精通的，浪费了大伙的时间，很是抱歉。但请给我次机会，让我尝试去简短的自我介绍下。
        </p>
        <p>
          咳咳，你好，我就是个烟桶子。
          <span className="blink" style={{ fontSize: 20 }}>
            |
          </span>
        </p>
      </div>
    );
  }
}
